---
type: DocumentSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DocumentSet

`Autodesk.Revit.DB.DocumentSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DocumentSet | — | `public DocumentSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( Document item )` |
| Method | Erase | — | `public virtual int Erase ( Document item )` |
| Method | ForwardIterator | — | `public virtual DocumentSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( Document item )` |
| Method | ReverseIterator | — | `public virtual DocumentSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |